_posts/2018-11-14-json解析器的实现.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <!-- 2021-01-15 五 17:51 -->
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>&lrm;</title>
    <meta name="generator" content="Org mode" />
    <meta name="author" content="Vincent Zhang" />
  </head>
  <body>
    <div id="preamble" class="status">
      <link
        rel="stylesheet"
        type="text/css"
        href="http://gongzhitaao.org/orgcss/org.css"
      />
    </div>
    <div id="content">
      <p>
        json
        是一种轻量级的数据交换格式，易于阅读和编写，也很容易被机器解析。一系列的优点使它在众多的数据交换格式中脱颖而出。是目前web开发中最受喜爱的数据交互格式
      </p>

      <div class="org-src-container">
        <pre
          class="src src-json"
        ><span style="color: #51afef;">{</span><span style="color: #51afef;">"&#22995;&#21517;"</span>: <span style="color: #98be65;">"&#24352;&#19977;"</span>, <span style="color: #51afef;">"&#24180;&#40836;"</span>: <span style="color: #98be65;">"18"</span><span style="color: #51afef;">}</span>
</pre>
      </div>

      <div class="org-src-container">
        <pre class="src src-json"><span style="color: #51afef;">[</span>
    <span style="color: #c678dd;">{</span>
    <span style="color: #51afef;">"&#22995;&#21517;"</span>: <span style="color: #98be65;">"&#24352;&#19977;"</span>,
    <span style="color: #51afef;">"&#24180;&#40836;"</span>:<span style="color: #98be65;">"18"</span>
    <span style="color: #c678dd;">}</span>,

    <span style="color: #c678dd;">{</span>
    <span style="color: #51afef;">"&#22995;&#21517;"</span>: <span style="color: #98be65;">"&#37324;&#26031;"</span>,
    <span style="color: #51afef;">"&#24180;&#40836;"</span>:<span style="color: #98be65;">"19"</span>

    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">]</span>
</pre>
      </div>

      <div id="outline-container-org104ad18" class="outline-2">
        <h2 id="org104ad18">json 包含的数据类型</h2>
        <div class="outline-text-2" id="text-org104ad18">
          <table>
            <colgroup>
              <col class="org-left" />

              <col class="org-left" />
            </colgroup>
            <thead>
              <tr>
                <th scope="col" class="org-left">JSON</th>
                <th scope="col" class="org-left">JAVA</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td class="org-left">string</td>
                <td class="org-left">Java中的String</td>
              </tr>

              <tr>
                <td class="org-left">number</td>
                <td class="org-left">Java中的Long或Double</td>
              </tr>

              <tr>
                <td class="org-left">true/false</td>
                <td class="org-left">Java中的Boolean</td>
              </tr>

              <tr>
                <td class="org-left">null</td>
                <td class="org-left">Java中的null</td>
              </tr>

              <tr>
                <td class="org-left">[array]</td>
                <td class="org-left">Java中的List或Object[]</td>
              </tr>

              <tr>
                <td class="org-left">{“key”:”value”}</td>
                <td class="org-left">Java中的Map</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>

      <div id="outline-container-org151ad77" class="outline-2">
        <h2 id="org151ad77">json 中格式的定义</h2>
        <div class="outline-text-2" id="text-org151ad77">
          <table>
            <colgroup>
              <col class="org-left" />

              <col class="org-left" />
            </colgroup>
            <thead>
              <tr>
                <th scope="col" class="org-left">token</th>
                <th scope="col" class="org-left">含义</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td class="org-left">NULL</td>
                <td class="org-left">null</td>
              </tr>

              <tr>
                <td class="org-left">NUMBER</td>
                <td class="org-left">数字</td>
              </tr>

              <tr>
                <td class="org-left">STRING</td>
                <td class="org-left">字符串</td>
              </tr>

              <tr>
                <td class="org-left">BOOLEAN</td>
                <td class="org-left">true/false</td>
              </tr>

              <tr>
                <td class="org-left">SEP_COLON</td>
                <td class="org-left">:</td>
              </tr>

              <tr>
                <td class="org-left">SEP_COMMA</td>
                <td class="org-left">,</td>
              </tr>

              <tr>
                <td class="org-left">BEGIN_OBJECT</td>
                <td class="org-left">{</td>
              </tr>

              <tr>
                <td class="org-left">END_OBJECT</td>
                <td class="org-left">}</td>
              </tr>

              <tr>
                <td class="org-left">BEGIN_ARRAY</td>
                <td class="org-left">[</td>
              </tr>

              <tr>
                <td class="org-left">END_ARRAY</td>
                <td class="org-left">]</td>
              </tr>

              <tr>
                <td class="org-left">END_DOCUMENT</td>
                <td class="org-left">表示JSON数据结束</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>

      <div id="outline-container-org005a7aa" class="outline-2">
        <h2 id="org005a7aa">解析思路</h2>
        <div class="outline-text-2" id="text-org005a7aa">
          <p>
            由于JSON的Object和Array可以嵌套，在读取过程中，使用一个栈来存储Object和Array是必须的。每当我们读到一个
            <code>BEGIN_OBJECT</code> 时，就创建一个
            <code>Map</code> 并压栈；每当读到一个
            <code>BEGIN_ARRAY</code> 时，就创建一个
            <code>List</code> 并压栈；每当读到一个 <code>END_OBJECT</code> 和
            <code>END_ARRAY</code>
            时，就弹出栈顶元素，并根据新的栈顶元素判断是否压栈。此外，读到Object的Key也必须压栈，读到后面的Value后将Key-Value压入栈顶的Map。
          </p>

          <p>
            如果读到
            <code>END_DOCUMENT</code>
            时，栈恰好只剩下一个元素，则读取正确，将该元素返回，读取结束。如果栈剩下不止一个元素，则JSON文档格式不正确。
          </p>

          <p>
            最后， <code>JsonReader</code> 的核心解析代码
            <code>parse()</code> 就是负责从
            <code>TokenReader</code>
            中不断读取Token，根据当前状态操作，然后设定下一个Token期望的状态，如果与期望状态不符，则JSON的格式无效。起始状态被设定为
            <code
              >STATUS_EXPECT_SINGLE_VALUE | STATUS_EXPECT_BEGIN_OBJECT |
              STATUS_EXPECT_BEGIN_ARRAY</code
            >
            ，即期望读取到单个value、 <code>{</code> 或
            <code>[</code> 。循环的退出点是读取到 <code>END_DOCUMENT</code> 时。
          </p>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="author">Author: Vincent Zhang</p>
      <p class="date">Created: 2021-01-15 五 17:51</p>
      <p class="validation">
        <a href="http://validator.w3.org/check?uri=referer">Validate</a>
      </p>
    </div>
  </body>
</html>
